{
  "jobs": [{
    "company": {
      "address": "São Carlos, SP",
      "avatar": "/static/images/arquivei.png",
      "name": "Arquivei"
    },
    "date": "Outubro de 2017 até o momento",
    "description": [
      "Sou responsável por evoluir o projeto de frontend que alimenta o SaaS com foco em agilidade e na qualidade do processo de desenvolvimento. Das tecnologias inseridas no projeto e na stack da equipe: ImmutableJS, Styled-components, NextJS",
      "Sou Responsável pela entrevista técnica dos processos seletivos de frontend em todos os níveis (estágio, jr, pleno e sênior).",
      "Aprimorei o processo de integração contínua e entrega contínua das aplicações de frontend com Bitbucket-pipelines, Circle CI e Kubernetes",
      "Participei na criação da equipe de design definindo os entregáveis para a equipe de frontend e participando dos processos seletivos. Durante esse período eu aprendi as ferramentas e tecnologias usadas pela equipe de design como Sketch, Zeplin, Invision, Figma, Photoshop, Design Sprint, teste de usabilidade e técnicas de UI/UX",
      "Participei da reestruturação da engenharia baseada no framework Squad do Spotify, criando novos times (squads) e projetos. Atuação com diferentes metodologias nos times, como: waterfall, basecamp, scrum e kanban."
    ],
    "position": "Frontend Software Engineer (Lead)"
  }, {
    "company": {
      "address": "São Carlos, SP",
      "name": "Arquivei"
    },
    "date": "Setembro de 2016 à Outubro de 2017",
    "description": [
      "Fui responsável por planejar, arquitetar e prototipar o desmembramento de uma aplicação monolítica em uma arquitetura frontend-backend.",
      "Fui responsável por montar a equipe de frontend preparando os processos seletivos de estágio para a equipe, criando o andaime do projeto e o definindo o processo de desenvolvimento.",
      "Desenvolvi a aplicação de frontend com server-side rendering (baseado no javascript universal) usando React, Redux, Less, Babel, ES+ (próxima geração), Webpack, NodeJS, Eslint, Jest, Enzyme."
    ],
    "position": "Frontend Software Engineer"
  }, {
    "company": {
      "address": "São Carlos, SP",
      "name": "Arquivei"
    },
    "date": "Junho a Setembro de 2016",
    "description": [
      "Aprendi todas as funcionalidade do SaaS Arquivei estudando todos os documentos fiscais eletrônicos como NFe, NFSe, NFCe, CTe, CFe-SAT, NFCe e MDFe. Além disso, aprendi o básico sobre alguns processos contábeis e tributários.",
      "Desenvolvi funcionalidades em uma aplicação monolítica com PHP, Zend FrameWork, jQuery, Grunt, Docker, Docker-compose, Redis e PostgreSQL.",
      "Reportei todas as atividades com o CTO através de metodologias ágeis (scrum)."
    ],
    "position": "Estagiário em Engenharia de Software"
  }, {
    "company": {
      "address": "São Carlos, SP",
      "avatar": "/static/images/angular.png",
      "name": "Angular Tecnologias"
    },
    "date": "Junho de 2015 a março de 2016",
    "description": [
      "Desenvolvi software sob demanda de sistemas acadêmicos, sistemas para o agronegócio e sistemas de anúncio. Alguns projetos de atuação: Posto Fiel, Vibarato, RASBQ, Palladium e LogTrac.",
      "Desenvolvi o frontend de aplicações SPAs com AngularJS, ES6, Bootstrap, SAAS, NPM e Grunt. Além disso, trabalhei com aplicações server-side rendering em Ruby On Rails e CoffeeScript com foco em SEO.",
      "Desenvolvi APIs restful em PHP, Java, Spring Framework, Ruby On Rails, Devise, CanCanCan, OmniAuth, MySQL, PostgreSQL e SQL Server.",
      "Integrei as aplicações desenvolvidos com sistemas de autenticação como Google+ e Facebook. Além disso, implementei integrações com portais de pagamento e sistemas de notificações (push) da Google Play e App Store.",
      "Administrei instâncias menores na Azure e na AWS, deployando aplicações escritas em Ruby on Rails e automatizada com Capistrano.",
      "Trabalhei com SVN e Git para controle de versão."
    ],
    "position": "Analista em Desenvolvimento de Sistemas"
  }, {
    "company": {
      "address": "São Carlos, SP",
      "avatar": "/static/images/eic.png",
      "name": "EIC - Espaço Interativo de Ciências"
    },
    "date": "Junho de 2014 a maio de 2015",
    "description": [
      "Desenvolvi projetos socioeducativos para rede pública de ensino fundamental e médio. Além disso, trabalhei com diferentes profissionais da educação analisando os requisitos dos projetos, organizando o conteúdo das aplicações e desenvolvendo as plataformas.",
      "Desenvolvi interfaces web para os alunos e painéis administrativos para gestão de conteúdo das plataformas, trabalhando com jQuery, AngularJS, CoffeeScript, Bootstrap e Grunt.",
      "Desenvolvi APIs restful em Ruby On Rails, Devise, CanCanCan e MySQL.",
      "Gerenciei um servidor ubuntu ‘on premise’ deployando todas as aplicações desenvolvidas.",
      "Trabalhei com SVN para controle de versão."
    ],
    "position": "Iniciação Científica"
  }]
}
